; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 240737 2 2 2 8 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation6 - direction
	Star3 - direction
	Star1 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star7)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 Star10)
	(have_image Star8 spectrograph0)
	(have_image Planet9 spectrograph0)
	(have_image Star10 spectrograph0)
	(have_image Planet11 infrared1)
	(have_image Phenomenon12 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 6
3. (turn_to satellite0 star1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star1)
   goals met: 0 of 6
4. (turn_to satellite1 planet11 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet11)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (turn_to satellite0 planet11 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet11)
   goals met: 0 of 6
7. (take_image satellite0 planet11 instrument0 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 1 of 6
8. (turn_to satellite0 star8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star8)
   goals met: 1 of 6
9. (take_image satellite0 star8 instrument0 spectrograph0)
   added: (have_image star8 spectrograph0)
   goals met: 2 of 6
10. (turn_to satellite0 planet9 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet9)
   goals met: 2 of 6
11. (take_image satellite0 planet9 instrument0 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 3 of 6
12. (turn_to satellite0 phenomenon12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 6
13. (take_image satellite0 phenomenon12 instrument0 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 4 of 6
14. (turn_to satellite0 star10 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star10)
   goals met: 5 of 6
15. (take_image satellite0 star10 instrument0 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 6 of 6
